{"list":[{"title":"Light Source","tutorialText":"This is your Light Source, Use it to direct your light beam towards the target, just pull on the screen and the light will start turning your way!","iconPath":"icons/lightsource","tutorialPlayedBefore":false},
	{"title":"Mirror","tutorialText":"This is a mirror, it has the same behavior as other mirrors: it reflects each incident light beam with a direction depending on the angle of incidence. It is used here to help to reach the target.","iconPath":"icons/mirror","tutorialPlayedBefore":false},
	{"title":"Checkpoint","tutorialText":"The checkpoint is used to rank your score on a level. When all checkpoints are in your path from start to finish maximum score is reached. If at least half are reached you score 2/3.","iconPath":"icons/checkpoint","tutorialPlayedBefore":false},
	{"title":"Color Changer","tutorialText":"It's an object called Color Changer, whose function is to transform the color of the laser beam when it falls into its surface. The newly generated light beam has the same color as the colorchanger’s color.","iconPath":"icons/colorchanger","tutorialPlayedBefore":false},
	{"title":"Gate","tutorialText":"The object Color gate let the light beam pass if and only if the incident light beam has the same color as its color","iconPath":"icons/gate","tutorialPlayedBefore":false},
	{"title":"Light Splitter","tutorialText":"Light demutiplexer is an object that divides each incident beam of light regardless of its color to three newly generated light rays with the color red, blue and green.","iconPath":"icons/lightsplitter","tutorialPlayedBefore":false},
	{"title":"Mover","tutorialText":"Moving objects will follow a certain pattern on the playing field, they are obstacles and the idea is to manage to reach the target by avoiding them.","iconPath":"icons/mover","tutorialPlayedBefore":false},
	{"title":"Deactivated Mirror","tutorialText":"Deactivated mirrors are mirrors that have the same function as other mirrors but they activated only when they are lighted on.","iconPath":"icons/deactivatedMirror","tutorialPlayedBefore":false}]}